p5/empty-example/org/sketch.html
<!doctype html>
<html lang="ru">
<head>
<title>P5JS sketch 01</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-12"><h1 class="title">P5JS sketch 01</h1>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Введение</h2>
<div class="outline-text-2" id="text-">
<p>
Пример написания программ с помощью p5js в стиле literate programming.
</p>

<p>
Экспорт исходников в файл настройки горячей клавишей <code>C-c C-v C-t</code>.
</p>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Базовый HTML-документ</h2>
<div class="outline-text-2" id="text-">
<div class="org-src-container">

<pre class="src src-html"><span style="color: #CC9393;">&lt;!DOCTYPE html&gt;</span>
&lt;<span style="color: #93E0E3;">html</span> <span style="color: #DFAF8F;">lang</span>=<span style="color: #CC9393;">""</span>&gt;

&lt;<span style="color: #93E0E3;">head</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">charset</span>=<span style="color: #CC9393;">"utf-8"</span>&gt;
  &lt;<span style="color: #93E0E3;">meta</span> <span style="color: #DFAF8F;">name</span>=<span style="color: #CC9393;">"viewport"</span> <span style="color: #DFAF8F;">content</span>=<span style="color: #CC9393;">"width=device-width, initial-scale=1.0"</span>&gt;
  &lt;<span style="color: #93E0E3;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">p5.js example</span>&lt;/<span style="color: #93E0E3;">title</span>&gt;
</pre>
</div>

<p>
Добавим ссылку на таблицу стилей.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">link</span> <span style="color: #DFAF8F;">rel</span>=<span style="color: #CC9393;">"stylesheet"</span> <span style="color: #DFAF8F;">href</span>=<span style="color: #CC9393;">"./styles_01.css"</span>&gt;
</pre>
</div>

<p>
А также на библиотеку P5JS и на исходный код нашей программы.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"../p5.js"</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
&lt;<span style="color: #93E0E3;">script</span> <span style="color: #DFAF8F;">src</span>=<span style="color: #CC9393;">"sketch_01.js"</span>&gt;&lt;/<span style="color: #93E0E3;">script</span>&gt;
</pre>
</div>

<p>
И завершение базового файла.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;/<span style="color: #93E0E3;">head</span>&gt;

&lt;<span style="color: #93E0E3;">body</span>&gt;
&lt;/<span style="color: #93E0E3;">body</span>&gt;

&lt;/<span style="color: #93E0E3;">html</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Таблица стилей</h2>
<div class="outline-text-2" id="text-">
<p>
Таблица стилей будет вынесена в отдельный файл для большей практичности.
</p>

<p>
Сейчас основная задача — убрать поля и полосы прокрутки, которые возникнут и будт мешать восприятию, если ничего не предпринять.
</p>

<div class="org-src-container">

<pre class="src src-css"><span style="color: #93E0E3;">html </span>{
    <span style="color: #F0DFAF; font-weight: bold;">overflow</span>: hidden;
    <span style="color: #F0DFAF; font-weight: bold;">overflow-x</span>: hidden;
}
<span style="color: #93E0E3;">body </span>{
    <span style="color: #F0DFAF; font-weight: bold;">padding</span>: 0;
    <span style="color: #F0DFAF; font-weight: bold;">margin</span>: 0;
}
<span style="color: #93E0E3;">canvas </span>{
    <span style="color: #F0DFAF; font-weight: bold;">display</span>: block;
}
<span style="color: #93E0E3;">video </span>{
    <span style="color: #F0DFAF; font-weight: bold;">display</span>: block;
}

</pre>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Скетч</h2>
<div class="outline-text-2" id="text-">
</div><div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Основы</h3>
<div class="outline-text-3" id="text-">
<p>
Проект на Processing (а также и P5JS) включает в обязательном порядке две функции.
</p>

<p>
<code>setup()</code> запускается только один раз в самом начале.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">setup</span>() {
}
</pre>
</div>

<p>
<code>draw()</code> запускается 60 раз в секунду. Это функция отрисовки кадра.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">draw</span>() {
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-" class="outline-3">
<h3 id="sec-">Подключаем изображение с вебкамеры</h3>
<div class="outline-text-3" id="text-">
<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #F0DFAF; font-weight: bold;">let</span> <span style="color: #DFAF8F;">capture</span>; <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1074;&#1077;&#1073;&#1082;&#1072;&#1084;&#1077;&#1088;&#1077;</span>

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">setup</span>() {
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1089; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086;</span>
    createCanvas(windowWidth, windowHeight);
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1074;&#1077;&#1073;&#1082;&#1072;&#1084;&#1077;&#1088;&#1077;</span>
    capture = createCapture(VIDEO);
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1077;&#1073;&#1082;&#1072;&#1084;&#1077;&#1088;&#1099; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1074;&#1080;&#1076;&#1077;&#1086;&#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;</span>
    capture.size(640, 480);
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">draw</span>() {
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1079;&#1072;&#1083;&#1080;&#1074;&#1082;&#1072; &#1086;&#1076;&#1085;&#1086;&#1088;&#1086;&#1076;&#1085;&#1099;&#1084; &#1090;&#1086;&#1085;&#1086;&#1084;</span>
    background(0);
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1072;&#1076;&#1088;&#1072;</span>
    image(capture, 0, 0, 640, 480);
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1080;&#1085;&#1074;&#1077;&#1088;&#1089;&#1080;&#1080;</span>
    filter(INVERT);
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;</span>
    ellipseMode(CENTER);
    ellipse(mouseX, mouseY, 20, 20);
}

<span style="color: #F0DFAF; font-weight: bold;">function</span> <span style="color: #93E0E3;">windowResized</span>() {
    <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1085;&#1072;&#1076;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</span>
    resizeCanvas(windowWidth, windowHeight);
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-" class="outline-2">
<h2 id="sec-">Завершение</h2>
<div class="outline-text-2" id="text-">
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div></div>
</footer>
</body>
</html>
